{
    "company_info": [
        "Putting People at the Heart of Everything We Do.",
        "34",
        "ML",
        "In Numbers",
        "8",
        "YEARS",
        "In Business",
        "100",
        "+",
        "Projects",
        "15",
        "+",
        "Industries",
        "8",
        "M",
        "Users",
        "Not Just Another Software House.",
        "From a classroom to a company.",
        "",
        "It all started in a computer science class at the AUC, where two minds first connected. This friendship led to a pivotal moment in 2016 when they decided to embark on a shared journey.",
        "",
        "Frustrated by the lack of customer-centric and quality software development providers, they saw a gap in the market. This vision grew into 34ML, a company dedicated to building bridges, not just lines of code; 34ML creates solutions that help our partners connect with their customers. ",
        "Check Our Services",
        "We prioritize",
        "W",
        "e",
        " ",
        "w",
        "o",
        "r",
        "k",
        "W",
        "e",
        " ",
        "f",
        "o",
        "c",
        "u",
        "s",
        "People-Oriented.",
        "I",
        "n",
        " ",
        "H",
        "a",
        "r",
        "m",
        "o",
        "n",
        "y",
        ".",
        "O",
        "n",
        " ",
        "Q",
        "u",
        "a",
        "l",
        "i",
        "t",
        "y",
        ".",
        "OUR VALUES",
        "More",
        "Than",
        "Just",
        "Coding.",
        "We're the partners who go beyond the code. ",
        "We dive into market research, understanding your customers and building solutions that resonate. And the journey doesn't end at launch; we continuously support you with valuable insights ensuring your success.",
        "We believe that “simplicity is the ultimate form of sophistication”. ",
        "Driven by simplicity & practicality, our team remains focused, designs clean interfaces, adds purposeful features, and maintains an effective & efficient app development process.",
        "Our main driver, and core value, will always be quality.",
        "From clear, organized documentation to seamless communication, we build a solid foundation for outstanding results. This translates to higher security, faster performance, smoother UX, and ultimately, the highest user satisfaction.",
        "Trusted By Industry Leaders",
        "We foster lasting partnerships built on shared success.",
        "“34ML not only met deadlines, but also maintained seamless communication throughout the project, demonstrating consistent dedication.”",
        "Banque Du Caire",
        "“34ML’s clear communication, flexibility, and timely delivery enhanced our app, boosting engagement and helping us achieve our goals.”",
        "Breadfast",
        "“34ML delivered a high-quality app on time, under a tight deadline. They're very responsive, efficient, and attentive to detail.”",
        "Grinta",
        "“I recommend 34ML because they don’t just sell their services like other providers; they treat us as partners.”",
        "New Avenue",
        "“34ML is a very reliable software house. Their team managed to build quite a complex mobile app in a tight timeline.”",
        "Kode",
        "“34ML was the partner who understood our needs, market dynamics, and the e-commerce space. They understand & solve real business challenges.”",
        "Colors",
        "“34ML team was very professional, helpful, and positive. They gave us feedback and advice as their partners.”",
        "Mori International",
        "“I recommend 34ML for their extensive industry experience and proactive advice beyond project scope, even after project completion.”",
        "Fit Squad",
        "“34ML made our digital transformation journey very smooth, crafting a clear project vision based on our business needs.”",
        "Family Transport",
        "“34ML has the full suite of services — website development was done properly, along with hosting and maintenance, all in one place.”",
        "Ezdehar",
        "“I recommend 34ML for their exceptional technical expertise, responsiveness, and valuable insights that extend beyond technical aspects.”",
        "Water Taxi",
        "“The 34ML team is both professional and friendly. They proactively suggest enhancements even after launch.”",
        "Misr Capital",
        "“The special thing about 34ML is their responsiveness and that they understand exactly what we need.”",
        "Premium Card",
        "Join Our Success Stories",
        "Let us know more about your project and let's get started.",
        "Let's Collaborate",
        "Our Partners",
        "Featured Articles",
        "Dive deeper into the articles that recognize our commitment to excellence and quality.",
        "Around Egypt: This New App Brings Egypt VR Tours to Your Mobile Screen",
        "Cairo Gossip",
        "Get A Front-Row Ticket To Egypt’s Best Touristic Spots With This Homegrown App",
        "Scoop Empire",
        "في مصر.. أبحر بين روائع حضارة بأكملها بكبسة زر فقط",
        "بالعربية CNN",
        "This New App Lets You Visit Egypt’s Most Iconic Sites in Virtual Reality",
        "Startup Scene",
        "App Development Companies for Efficient Mobile App Building",
        "Cyber News",
        "Two Alums Create 'Around Egypt' App to Promote Tourism, Show Country's 'Hidden Gems' in 360 Degrees",
        "The American University in Cairo",
        "Services",
        "Work",
        "Company",
        "Careers",
        "Blog",
        "Contact Us",
        "READY TO COLLABORATE?",
        "Start your project journey with us.",
        "Contact Us",
        "Copyright © 34ML.",
        "All rights reserved.",
        "Privacy Policy",
        "Terms"
    ]
}