{
    "services": [
        "We Use Tech to Craft Scalable Digital Solutions",
        "We are digital enablers;",
        "Understanding what digital means to your business,",
        "We solve your business challenges with custom tech solutions, bridging your vision to success as your dedicated tech partner.",
        "Product Design",
        "Apps",
        "Technology",
        "Product Design",
        "Solution Design",
        "Roadmapping",
        "User Research",
        "Prototyping",
        "Branding",
        "User Interface Design",
        "3rd Party Contracting",
        "Explore Our Success Stories",
        "Technology Is Our  ",
        "Playground ",
        "We focus on generating value for our customers through intuitive user experiences",
        "Server Availability",
        "99.9%",
        "Impressive average server uptime",
        "Scalability",
        "More Than",
        "8M",
        "Supported users for different customers across Web, Android, iOS, Huawei & Oculus platforms.",
        "App Store ",
        "Charts",
        "Top 10",
        "Kode was ranked amongst the top 10 sports apps",
        "App Store Charts",
        "Top 50",
        "Premium Card was ranked amongst the top 50 fintech apps",
        "App Store Charts",
        "Top 3",
        "Around Egypt was ranked amongst the top 3 travel apps",
        "Loading Time",
        "Under",
        "2 Sec",
        "Optimized project’s loading time.",
        "HBM",
        "HBM is a DIY no-code website and app-builder that anyone can use. HBM empowers e-commerce business owners to bring their online stores to life and get closer to their customers without writing a single line of code. All you need to do is choose your branding, choose your features, add your products and you're ready to go live.",
        "Visit Website",
        "Around Egypt",
        "Around Egypt is a mobile app offering users a virtual reality (VR) experience of Egypt's scenic spots through 360-degree tours. For an enhanced experience, users with a VR Oculus Headset or Cardboard can fully immerse themselves in a virtual reality experience.",
        "Download App",
        "AR Beautifier",
        "34ML has designed and developed AR beautifier mobile application using the latest augmented reality techniques allowing women to try out different makeup products and colors in real-time. With AR beautifier, users can try out various makeup products to find the perfect match for their skin tone and preferences wasting no money on mismatched makeup products.",
        "Download App",
        "Smarty",
        "Smarty App is a fun augmented reality game that helps you teach toddlers and preschoolers all about animals in a fun and engaging way through Augmented Reality. Nowadays, Interactive learning not only is as natural as a pen and paper, but also has been proven to increase learning outcomes.",
        "Download App",
        "Knfrm",
        "Knfrm is a digital tool that creates, verifies and manages contracts. It is a one-stop tool for all your contract management requirements. Manage your contracts around the clock hassle-free. Knfrm provides businesses with a regulated end-to-end solution allowing for a more efficient and a much simpler contracting process.",
        "Visit Website",
        "Services",
        "Work",
        "Company",
        "Careers",
        "Blog",
        "Contact Us",
        "HAVE A PROJECT IN MIND?",
        "Let's collaborate and bring your vision to life.",
        "Contact Us",
        "Copyright © 34ML.",
        "All rights reserved.",
        "Privacy Policy",
        "Terms"
    ]
}